tap "adoptopenjdk/openjdk"
tap "bramstein/webfonttools"
tap "buo/cask-upgrade"
tap "cjbassi/ytop"
tap "derailed/k9s"
tap "dteoh/sqa"
tap "fabianishere/personal"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "joedrago/repo"
tap "louisbrunner/valgrind"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "samtay/tui"
tap "teamookla/speedtest"
# Search tool like grep, but optimized for programmers
brew "ack"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Color management engine supporting ICC profiles
brew "little-cms2"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Record and share terminal sessions
brew "asciinema"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# B2 Cloud Storage Command-Line Tools
brew "b2-tools"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# GNU binary tools for native development
brew "binutils"
# GNU compiler collection
brew "gcc"
# Library for complex text layout
brew "libraqm"
# Package for scientific computing with Python
brew "numpy"
# Tool Command Language
brew "tcl-tk"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Parser generator
brew "bison"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy", restart_service: true
# Decentralized dependency manager for Cocoa
brew "carthage"
# GNU File, Shell, and Text utilities
brew "coreutils"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound", restart_service: true
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Emacs dependency management
brew "cask"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Ruby environment tool
brew "chruby"
# Work on automating classical cipher cracking in C
brew "cifer"
# Console Matrix
brew "cmatrix"
# Configurable talking characters in ASCII art
brew "cowsay"
# Shell script to build fancy DMGs
brew "create-dmg"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Tools to work with Android .dex and Java .class files
brew "dex2jar"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# TCP over DNS tunnel
brew "dns2tcp"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Tool for managing dock items
brew "dockutil"
# Run arbitrary commands when files change
brew "entr"
# Multipurpose sniffer/interceptor/logger for switched LAN
brew "ettercap"
# Modern replacement for 'ls'
brew "exa"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# CLI application for interacting with a Cloudflare account
brew "flarectl"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Console program to recover files based on their headers and footers
brew "foremost"
# Generic library support script
brew "libtool"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Frame Streams implementation in C
brew "fstrm"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git", link: false
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Network related modules for glib
brew "glib-networking"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Compiler for the GObject type system
brew "vala"
# Flexible API to implement spellchecking in GTK+ applications
brew "gspell"
# Text view with syntax, undo/redo, and text marks
brew "gtksourceview4"
# Collection library providing GObject-based interfaces
brew "libgee"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Glib wrapper library around libgit2 git access library
brew "libgit2-glib"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# GObject plugin library
brew "libpeas"
# C library for the Public Suffix List
brew "libpsl"
# HTTP client/server library for GNOME
brew "libsoup@2"
# GNOME GUI client to view git repositories
brew "gitg"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Optical Character Recognition (OCR), converts images back to text
brew "gocr"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# GNU grep, egrep and fgrep
brew "grep"
# Tool to exploit hash length extension attack
brew "hashpump"
# Kubernetes package manager
brew "helm"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Spell checker and morphological analyzer
brew "hunspell"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Open source relational database management system
brew "mysql-client"
# Network logon cracker which supports many services
brew "hydra"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Port-knock server
brew "knock"
# Protocol buffers library
brew "protobuf-c"
# High-performance authoritative-only DNS server
brew "knot", restart_service: true
# Network authentication protocol
brew "krb5"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# DNS library written in C
brew "ldns"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Library and utility to talk to iBoot/iBSS via USB
brew "libirecovery"
# Library that provides automatic proxy configuration management
brew "libproxy"
# YAML Parser
brew "libyaml"
# Emulator for x86 and PowerPC
brew "qemu"
# Linux virtual machines
brew "lima"
# Find your location using Apple's geolocation services
brew "locateme"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Fast and simple video downloader
brew "lux"
# Text-based web browser
brew "lynx"
# Swiss Army Knife for macOS
brew "m-cli"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# GUI for vim, made for macOS
brew "macvim"
# Securely transfers data between computers
brew "magic-wormhole"
# Mac App Store command-line interface
brew "mas"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Platform built on V8 to build network applications
brew "node@16"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql"
# NCurses Disk Usage
brew "ncdu"
# FTP client with an advanced user interface
brew "ncftp"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node", link: false
# Platform built on V8 to build network applications
brew "node@14"
# Trigger notifications when a process completes
brew "noti"
# Libraries for security-enabled client and server applications
brew "nss"
# Optical character recognition (OCR) program
brew "ocrad"
# Tools and libraries for smart cards
brew "opensc"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# PNG file optimizer
brew "optipng"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# General-purpose scripting language
brew "php", restart_service: true
# New zlib (gzip, deflate) compatible compressor
brew "zopfli"
# Parallel gzip
brew "pigz"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Print info and check PNG, JNG, and MNG files
brew "pngcheck"
# Modern replacement for ps written by Rust
brew "procs"
# Implementation of Telnet and SSH
brew "putty"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8", link: false
# Cross-platform application and UI framework
brew "qt"
# Cross-platform application and UI framework
brew "qt@5"
# Software environment for statistical computing
brew "r"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Monitors sleep, wakeup, and idleness of a Mac
brew "sleepwatcher", restart_service: true
# Terminal based presentation tool
brew "slides"
# SOcket CAT: netcat on steroids
brew "socat"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Tool to impose load on and stress test a computer system
brew "stress"
# Version control system designed to be a better CVS
brew "subversion"
# TCP/IP packet demultiplexer
brew "tcpflow"
# Replay saved tcpdump files at arbitrary speeds
brew "tcpreplay"
# Analyze tcpdump output
brew "tcptrace"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "terraform"
# Tool which checks for the support of TLS/SSL ciphers and flaws
brew "testssl"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr", link: false
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tools for building TCP client-server applications
brew "ucspi-tcp"
# Visual Binary Diff
brew "vbindiff"
# Disaster recovery for Kubernetes resources and persistent volumes
brew "velero"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# Network settings helper
brew "whatmask"
# Show the current WiFi network password
brew "wifi-password"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# PDF viewer
brew "xpdf"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn", link: false
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Command-line tool for the YubiKey PIV application
brew "yubico-piv-tool"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Convert existing TrueType/OpenType fonts to WOFF format
brew "bramstein/webfonttools/sfnt2woff"
# WOFF utilities with Zopfli compression
brew "bramstein/webfonttools/sfnt2woff-zopfli"
# A TUI system monitor written in Rust
brew "cjbassi/ytop/ytop"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "fabianishere/personal/pam_reattach"
# Nomad
brew "hashicorp/tap/nomad"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Tetris in your terminal
brew "samtay/tui/tetris"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Trains AIs to understand and translate texts
cask "deepl"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Reimagine your terminal
cask "fig"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "font-menlo-for-powerline"
cask "font-source-code-pro"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk-for-visual-studio"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Integrated development environment
cask "visual-studio"
# Open-source code editor
cask "visual-studio-code"
# Simple menu bar app to download YouTube movies
cask "youtube-downloader"
mas "AdBlock", id: 1402042596
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Messenger", id: 1480068668
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "The Unarchiver", id: 425424353
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
mas "Xmind", id: 1327661892
